JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.h
/*! @brief Switch management Tx Option */
typedef struct _swt_tx_opt
{
    uint32_t flags;             /*!< A bitmask of swt_mgmt_tx_opt_flags */
    netc_enetc_vlan_tag_t vlan; /*!< VLAN tag which will be inserted, used if enVlanInsert is set */
} swt_tx_opt;

/*! @brief Switch management Tx Timestamp Reference Response */
typedef struct _swt_tsr_resp_t
{
    uint32_t timestamp; /*!< Switch response timestamp. */
    uint32_t txtsid;    /*!< Transmit timestamp identifier. */
} swt_tsr_resp_t;

/*!
 * @brief Transfer configuration structure for Switch
 *
 * @note When need use Switch/EP receive APIs, recommended enable mgmtRxBdrConfig to use special MgmtRxBdRing rings to
 *       receive these host reason not-zero frames
 */
struct _swt_transfer_config
{
    bool rxCacheMaintain;          /*!< Enable/Disable Rx buffer cache maintain in driver. */
    bool txCacheMaintain;          /*!< Enable/Disable Tx buffer cache maintain in driver. */
    bool rxZeroCopy;               /*!< Enable zero-copy receive mode. */
    swt_rx_alloc_cb_t rxBuffAlloc; /*!< Callback function to alloc memory, must be provided for zero-copy Rx. */
    swt_rx_free_cb_t rxBuffFree;   /*!< Callback function to free memory, must be provided for zero-copy Rx. */
    bool enUseMgmtRxBdRing; /*!< Enable/Disable use Switch management Rx BD ring, if disabled, the Switch/EP receive
                        APIs (SWT_GetRxFrameSize()/SWT_ReceiveFrameCopy()/SWT_GetTimestampRefResp()/SWT_ReceiveFrame())
                        will use EP Rx BD ring 0 to receive frames. */
    bool enUseMgmtTxBdRing; /*!< Enable/Disable use Switch management Tx BD ring, if disabled, can't use Switch transfer
                               API (SWT_SendFrame()) to send frames. */
    netc_rx_bdr_config_t mgmtRxBdrConfig; /*!< Switch management Rx BD ring configuration. */
    netc_tx_bdr_config_t mgmtTxBdrConfig; /*!< Switch management Rx BD ring configuration. */
    swt_reclaim_cb_t reclaimCallback;     /*!< Callback for reclaimed Tx Switch management frames. */
    void *userData;                       /*!< User data, return in callback. */
};

/*! @} */ // end of netc_swt_xfer
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_xfer
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_datapath
#endif
/*! @addtogroup netc_swt_datapath
 * @{
 */

/*! @} */ // end of netc_swt_datapath
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_datapath
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_stat
#endif
/*! @addtogroup netc_swt_stat
 * @{
 */

/*! @} */ // end of netc_swt_stat
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_stat
#endif

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_init
#endif
/*! @addtogroup netc_swt_init
 * @{
 */

/*!
 * @brief Init SWITCH
 *
 * @param handle
 * @param config The user configuration
 * @return status_t
 */
status_t SWT_Init(swt_handle_t *handle, const swt_config_t *config);

/*!
 * @brief Deinit switch
 *
 * @param handle
 * @return status_t
 */
status_t SWT_Deinit(swt_handle_t *handle);

/*!
 * @brief Get deafult configuration for switch
 *
 * @param config
 * @return status_t
 */
status_t SWT_GetDefaultConfig(swt_config_t *config);

/*!
 * @brief Set MII speed and duplex for switch ethernet port
 *
 * @param handle
 * @param ethPort
 * @param speed
 * @param duplex
 * @return status_t
 */
status_t SWT_SetEthPortMII(swt_handle_t *handle,
                           uint8_t ethPort,
                           netc_hw_mii_speed_t speed,
                           netc_hw_mii_duplex_t duplex);

/*!
 * @brief Set switch port speed
 *
 * @param handle
 * @param portIdx
 * @param pSpeed
 */
static inline void SWT_SetPortSpeed(swt_handle_t *handle, netc_hw_port_idx_t portIdx, uint16_t pSpeed)
{
    NETC_PortSetSpeed(handle->hw.ports[portIdx].port, pSpeed);
}

/*! @} */ // end of netc_swt_init
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_init
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_ntmp
#endif
/*! @addtogroup netc_swt_ntmp
 * @{
 */

/*!
 * @brief Init SWITCH command BD ring.
 *
 * @param handle
 * @param ring Command BD ring index
 * @param config The user configuration
 * @return status_t
 */
status_t SWT_CmdBDRInit(swt_handle_t *handle, netc_hw_swt_cbdr_idx_t ring, const netc_cmd_bdr_config_t *config);

/*!
 * @brief Deinit switch command BD ring.
 *
 * @param handle
 * @param ring Command BD ring index
 * @return status_t
 */
status_t SWT_CmdBDRDeinit(swt_handle_t *handle, netc_hw_swt_cbdr_idx_t ring);

/*! @} */ // end of netc_swt_ntmp
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_ntmp
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_interrupt
#endif
/*! @addtogroup netc_swt_interrupt
 * @{
 */

/*!
 * @brief Set the global MSIX mask status
 *
 * This function masks/unmasks global MSIX message.
 * Mask - All of the vectors are masked, regardless of their per-entry mask bit states.
 * Unmask - Each entry's mask status determines whether the vector is masked or not.
 *
 * @param handle    The EP handle
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t SWT_MsixSetGlobalMask(swt_handle_t *handle, bool mask);

/*!
 * @brief Set the MSIX entry mask status for specified entry
 *
 * This function masks/unmasks MSIX message for specified entry.
 *
 * @param handle    SWT handle.
 * @param entryIdx  The entry index in the table.
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t SWT_MsixSetEntryMask(swt_handle_t *handle, uint8_t entryIdx, bool mask);

/*!
 * @brief Get the MSIX pending status in MSIX PBA table
 *
 * This function is to get the entry pending status from MSIX PBA table. If interrupt occurs but masked by vector
 * control of entry, pending bit in PBA will be set.
 *
 * @param handle  SWT handle.
 * @param pbaIdx  The index of PBA array with 64-bit unit.
 * @param status  Pending status bit mask, bit n for entry n.
 * @return status_t
 */
status_t SWT_MsixGetPendingStatus(swt_handle_t *handle, uint8_t pbaIdx, uint64_t *status);

/*! @} */ // end of netc_swt_interrupt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_interrupt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_rx
#endif
/*! @addtogroup netc_swt_rx
 * @{
 */
/*!
 * @brief Configure switch ingress mirror
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t SWT_RxMirrorConfig(swt_handle_t *handle, const netc_swt_imr_config_t *config);
/*!
 * @brief Configure Parser in Receive Data Path
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxParserConfig(swt_handle_t *handle,
                                          netc_hw_port_idx_t portIdx,
                                          const netc_port_parser_config_t *config)
{
    NETC_PortSetParser(handle->hw.ports[portIdx].port, config);
    return kStatus_Success;
}

/*!
 * @brief Configure the customer vlan type
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxVlanCInit(swt_handle_t *handle, const netc_vlan_classify_config_t *config)
{
    NETC_RxVlanCInit(handle->hw.common, config, true);
    return kStatus_Success;
}

/*!
 * @brief Configure the Accepted Vlan for PORT.
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxVlanCConfigPort(swt_handle_t *handle,
                                             netc_hw_port_idx_t portIdx,
                                             netc_port_vlan_classify_config_t *config)
{
    NETC_PortSetVlanClassify(handle->hw.ports[portIdx].port, config);
    return kStatus_Success;
}

// Qos Classification
/*!
 * @brief Init the ingress QoS classification for Switch
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxQosCInit(swt_handle_t *handle, const netc_swt_qos_classify_config_t *config)
{
    NETC_RxQosCInit(handle->hw.common, &config->profiles[0], false);
    NETC_RxQosCInit(handle->hw.common, &config->profiles[1], true);
    return kStatus_Success;
}

/*!
 * @brief Configure the QoS Classification for Switch Port
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxQosCConfigPort(swt_handle_t *handle,
                                            netc_hw_port_idx_t portIdx,
                                            netc_port_qos_classify_config_t *config)
{
    NETC_PortSetQosClassify(handle->hw.ports[portIdx].port, config);
    return kStatus_Success;
}

// Ingress Port Filter
/*!
 * @brief Enable / Disable Ingress Port Filtering
 *
 * Applied for both Switch and ENETC
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxIPFInit(swt_handle_t *handle, const netc_ipf_config_t *config)
{
    NETC_IPFInit(handle->hw.common, config);
    return kStatus_Success;
}
/*!
 * @brief Config the IPF for specified Port
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxIPFConfigPort(swt_handle_t *handle,
                                           netc_hw_port_idx_t portIdx,
                                           const netc_port_ipf_config_t *config)
{
    NETC_PortSetIPF(handle->hw.ports[portIdx].port, config);
    return kStatus_Success;
}

/*!
 * @brief Get remaining available word number (words size is 6 bytes) of the ingress Port Filter Table.
 * @note  This is a ternary match table, and the entries can vary in size, from 2 to 14 words.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxIPFGetTableRemainWordNum(swt_handle_t *handle)
{
    return (handle->hw.common->IPFTCAPR & NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->IPFTMOR & NETC_SW_ENETC_IPFTMOR_NUM_WORDS_MASK);
}

/*!
 * @brief Add an entry for the ingress Port Filter Table.
 *
 * This function do an add & query with return hardware id which can be used as future query / delete / update.
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxIPFAddTableEntry(swt_handle_t *handle, netc_tb_ipf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in the ingress Port Filter Table.
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxIPFUpdateTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_ipf_cfge_t *cfg);

/*!
 * @brief Delete an entry for the ingress Port Filter Table.
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxIPFDelTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Reset the counter of an ingress port filter entry
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxIPFResetMatchCounter(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the matched count for entry in IPF
 *
 * @param handle
 * @param entryID
 * @param count
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxIPFGetMatchedCount(swt_handle_t *handle, uint32_t entryID, uint64_t *count);

// PSPF
/*!
 * @brief Init the Switch PSFP
 * Cover configuration below
 * - ISI  key construction profiles (ISIDKC0CR0 - ISIDKC3CR0)
 *
 * Not Cover
 * - Port specific isi config
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxPSFPInit(swt_handle_t *handle, const netc_swt_psfp_config_t *config)
{
    NETC_PSFPKcProfileInit(handle->hw.common, &config->kcRule[0], false);
    NETC_PSFPKcProfileInit(handle->hw.common, &config->kcRule[2], true);
    return kStatus_Success;
}

/*!
 * @brief Configure Ingress stream identification for specified port
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_RxPSFPConfigPortISI(swt_handle_t *handle,
                                               netc_hw_port_idx_t portIdx,
                                               const netc_port_psfp_isi_config *config)
{
    NETC_PortSetISI(handle->hw.ports[portIdx].port, config);
    return kStatus_Success;
}

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of stream identification table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream Filter,
 *       VLAN Filter, FDB, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetISITableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add an entry into the stream identification table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddISITableEntry(swt_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID);

/*!
 * @brief Delete an entry in the stream identification table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelISITableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of ingress stream table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetISTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->ISITCAPR & NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISITOR & NETC_SW_ENETC_ISITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add an entry into the ingress stream table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddISTableEntry(swt_handle_t *handle, netc_tb_is_config_t *config);

/*!
 * @brief Updtae an entry in the ingress stream table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPUpdateISTableEntry(swt_handle_t *handle, netc_tb_is_config_t *config);

/*!
 * @brief Delete an entry in the stream identification table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelISTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of ingress stream filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, VLAN Filter, FDB, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetISFTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add an entry into the ingress stream filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddISFTableEntry(swt_handle_t *handle, netc_tb_isf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update an entry in the ingress stream filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPUpdateISFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_isf_cfge_t *cfg);

/*!
 * @brief Delete an entry in the ingress stream filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelISFTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of Rate Policying table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetRPTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->RPITCAPR & NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->RPITOR & NETC_SW_ENETC_RPITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry to Rate Policying table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddRPTableEntry(swt_handle_t *handle, netc_tb_rp_config_t *config);

/*!
 * @brief Update entry in Rate Policying table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPUpdateRPTableEntry(swt_handle_t *handle, netc_tb_rp_config_t *config);

/*!
 * @brief Delete entry in the Rate policying table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelRPTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get statistic of specified Rate Policer entry
 *
 * @param handle
 * @param entryID
 * @param statis
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetRPStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_rp_stse_t *statis);

/*!
 * @brief Get remaining available entry number of ingress stream count table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetISCTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->ISCITCAPR & NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISCITOR & NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in ingress stream count table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddISCTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get ingress stream count statistic
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetISCStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic);

/*!
 * @brief Reset the count of the ingress stream count
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPResetISCStatistic(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of stream gate instance table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGITableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGIITCAPR & NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->SGIITOR & NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddSGITableEntry(swt_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Update entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPUpdateSGITableEntry(swt_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Delete entry in stream gate instance table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelSGITableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get state of the stream gate instance for specified entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGIState(swt_handle_t *handle, uint32_t entryID, netc_tb_sgi_sgise_t *state);

/*!
 * @brief Get remaining available words number of Stream Gate Control List table
 * @note This is a dynamic bounded index table, and number of words required for a stream gate
 *       control list is 1+N/2 where N is number of gate time slots in the stream gate control list.
 *       The remaining word should be greater than the want added entry size
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGCLTableRemainWordNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGCLITCAPR & NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->SGCLTMOR & NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_MASK);
}

/*!
 * @brief Add entry into Stream Gate Control List Table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddSGCLTableEntry(swt_handle_t *handle, netc_tb_sgcl_gcl_t *config);

/*!
 * @brief Delete entry of Stream Gate Control List Table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelSGCLTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get Stream Gate Control List Table entry gate control list
 *
 * @param handle
 * @param gcl
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGCLGateList(swt_handle_t *handle, netc_tb_sgcl_gcl_t *gcl, uint32_t length);

/*!
 * @brief Get state (ref count) for Stream Gate Control List table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGCLState(swt_handle_t *handle, uint32_t entryID, netc_tb_sgcl_sgclse_t *state);

/*! @} */ // end of netc_swt_rx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_rx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_mgt
#endif
/*! @addtogroup netc_swt_mgt
 * @{
 */

/*!
 * @brief Config the Bridge
 *
 * Cover configuration below
 * - Vlan filter table default VFHTDRCR0-2
 *
 * Not Cover
 * - Port specific Vlan config
 * - Port Storm Control BPSCR0/R1
 * - FDB entry
 * - Vlan Filter Table entry
 * - Multicast filter entry
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t SWT_BridgeInit(swt_handle_t *handle, const netc_swt_bridge_config_t *config);

/*!
 * @brief Config bridge port vlan Tx/Rx
 *
 * Cover configuration below
 * - Port specific Vlan config
 * - Port Storm Control BPSCR0/R1
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
status_t SWT_BridgeConfigPort(swt_handle_t *handle,
                              netc_hw_port_idx_t portIdx,
                              const netc_swt_port_bridge_config_t *config);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge vlan filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, FDB, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetVFTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

