JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.h
/*!
 * @brief Add entry into bridge vlan filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddVFTableEntry(swt_handle_t *handle, netc_tb_vf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge vlan filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateVFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_vf_cfge_t *cfg);

/*!
 * @brief Delete entry in bridge vlan filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelVFTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge FDB table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, VLAN Filter, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetFDBTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add entry into bridge FDB table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddFDBTableEntry(swt_handle_t *handle, netc_tb_fdb_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge FDB table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateFDBTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_cfge_t *cfg);

/*!
 * @brief Search entry in bridge FDB table
 *
 * @note Only support search and return one entry at a time.
 *
 * @param handle
 * @param sCriteria
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeSearchFDBTableEntry(swt_handle_t *handle,
                                       netc_tb_fdb_search_criteria_t *sCriteria,
                                       netc_tb_fdb_rsp_data_t *rsp);

/*!
 * @brief Delete an entry in bridge FDB Table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelFDBTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the activity data for FDB table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeGetFDBActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_acte_t *state);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge L2 IPV4 multicast filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, VLAN Filter, FDB table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetL2MCFTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add entry into Bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddL2MCFTableEntry(swt_handle_t *handle, netc_tb_l2mcf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_cfge_t *cfg);

/*!
 * @brief Search entry in bridge L2 IPV4 multicast filter table
 *
 * @note Only support search and return one entry at a time.
 *
 * @param handle
 * @param sCriteria
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeSearchL2MCFTableEntry(swt_handle_t *handle,
                                         netc_tb_l2mcf_search_criteria_t *sCriteria,
                                         netc_tb_l2mcf_rsp_data_t *rsp);

/*!
 * @brief Get the activity data for bridge L2 IPV4 multicast filter table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeGetL2MCFActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_acte_t *state);

/*!
 * @brief Delete entry in bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID);

// Frame Modification
/*!
 * @brief Config Port level Frame Modification
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_FMConfigPort(swt_handle_t *handle,
                                        netc_hw_port_idx_t portIdx,
                                        const netc_swt_port_fm_config_t *config)
{
    NETC_PORT_Type *base = handle->hw.ports[portIdx].port;
    base->PFMCR          = NETC_PORT_PFMCR_FMMA(config->ignoreFMMiscfg);
    base->PPCPDEIMR =
        NETC_PORT_PPCPDEIMR_DRME(config->enUpdateVlanDei) | NETC_PORT_PPCPDEIMR_EPCPMPV(config->enEgressPcpMap) |
        NETC_PORT_PPCPDEIMR_EPCPMP(config->egressPcpMap) | NETC_PORT_PPCPDEIMR_IPCPMPV(config->enIngressPcpMap) |
        NETC_PORT_PPCPDEIMR_IPCPMP(config->ingressPcpMap) |
        (((uint32_t)config->drToDeiMap & 0xFU) << NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT);
    base->PQOSMR = (base->PQOSMR & ~NETC_PORT_PQOSMR_QVMP_MASK) | NETC_PORT_PQOSMR_QVMP(config->qosVlanMap);
    return kStatus_Success;
}

/*!
 * @brief Get remaining available entry number of Frame Modification table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FMGetTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->FMITCAPR & NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->FMITOR & NETC_SW_ENETC_FMITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry into the Frame Modification table
 *
 * Add entry of the frame modification table. Frame modification can be encoded into the table id directly or provided
 * as index of the table entry. refer to the frame modification entry definition.
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMAddTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config);

/*!
 * @brief Update entry in the Frame Modification table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMUpdateTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config);

/*!
 * @brief Delete table entry in Frame Modification Table
 *
 * The provided ID must be table index. Error return if the id is action encoded id.
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDelTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get word number (word size is 24  bytes) of Frame Modification data table
 * @note This is a static bounded index table, when update or query table, should satisifed:
 *       numBytes + ENTRY_ID <= 24 * wordNumber .
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FMDGetTableWordsNum(swt_handle_t *handle)
{
    return handle->hw.common->FMDITCAPR & NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_MASK;
}

/*!
 * @brief Update Frame Modification data table contents
 *
 * @param handle
 * @param config
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDUpdateTableEntry(swt_handle_t *handle, netc_tb_fmd_update_config_t *config, uint32_t length);
/*!
 * @brief Query Frame Modification data table contents
 *
 * @param handle
 * @param query
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDQueryTableEntry(swt_handle_t *handle, netc_tb_fmd_query_buffer_t *query, uint32_t length);

/*!
 * @brief Get remaining available entry number of ingress Sequence Generation table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FRERGetISEQGTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISQGITOR & NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry into FRER sequence number generation table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERAddISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config);

/*!
 * @brief Update entry in FRER sequence number generation table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERUpdateISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config);

/*!
 * @brief Delete entry in FRER sequence number generation table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERDelISEQGTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the Sequence generation number form sequence generation table for specified entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERGetISEQGState(swt_handle_t *handle, uint32_t entryID, netc_tb_iseqg_sgse_t *state);

/*!
 * @brief Get the number of entries assigned to FRER sequence number recovery table
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_FRERConfigESEQRTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FRERGetESEQRTableEntryNum(swt_handle_t *handle)
{
    return handle->hw.common->ESQRTCAPR & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK;
}

/*!
 * @brief Config FRER sequence number recovery table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERConfigESEQRTableEntry(swt_handle_t *handle, netc_tb_eseqr_config_t *config);

/*!
 * @brief Get FRER sequence recorvery table state and statistic
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERGetESEQRStatistic(swt_handle_t *handle,
                                   uint32_t entryID,
                                   netc_tb_eseqr_stse_t *statistic,
                                   netc_tb_eseqr_srse_t *state);

/*!
 * @brief Get Buffer Pool table entry number
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_UpdateBPTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_GetBPTableEntryNum(swt_handle_t *handle)
{
    return handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_BP_MASK;
}

/*!
 * @brief Update Buffer Pool table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_UpdateBPTableEntry(swt_handle_t *handle, netc_tb_bp_config_t *config);

/*!
 * @brief Get Buffer Pool table entry State
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetBPEntryState(swt_handle_t *handle, uint32_t entryID, netc_tb_bp_bpse_t *state);

/*!
 * @brief Get Shared Buffer Pool table entry number
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_UpdateSBPTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_GetSBPTableEntryNum(swt_handle_t *handle)
{
    return (handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_SPB_MASK) >> NETC_SW_BPCAPR_NUM_SPB_SHIFT;
}

/*!
 * @brief Update Shared Buffer Pool table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_UpdateSBPTableEntry(swt_handle_t *handle, netc_tb_sbp_config_t *config);

/*!
 * @brief Get Shared Buffer Pool table entry State
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetSBPEntryState(swt_handle_t *handle, uint32_t entryID, netc_tb_sbp_sbpse_t *state);

