JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.h
/*! @} */ // end of netc_swt_tx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_tx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_xfer
#endif
/*! @addtogroup netc_swt_xfer
 * @{
 */

/*!
 * @brief Set the EP handle used by switch frame management.
 *
 * @param handle
 * @param epHandle The EP handle
 * @param txRxConfig Switch transfer config
 * @retval status_t
 */
status_t SWT_ManagementTxRxConfig(swt_handle_t *handle, ep_handle_t *epHandle, const swt_transfer_config_t *txRxConfig);

/*!
 * @brief Transmits a management frame on a specific port.
 *
 * @param handle
 * @param ringOrQueue The ring index for Port masquerading or egress port priority/dr for direct enqueue
 * @param swtPort The ingress port for Port masquerading or egress for direct enqueue
 * @param enMasquerade Ture - Use Port masquerading Tx option, False - Use direct enqueue Tx Option
 * @param frame The frame descriptor pointer
 * @param context Private context provided back on reclaim
 * @param opt Tx options.
 * @retval status_t
 */
status_t SWT_SendFrame(swt_handle_t *handle,
                       swt_mgmt_tx_arg_t ringOrQueue,
                       netc_hw_port_idx_t swtPort,
                       bool enMasquerade,
                       netc_frame_struct_t *frame,
                       void *context,
                       swt_tx_opt *opt);

/*!
 * @brief Wait until the EP Tx ring has completed the transfer.
 *
 * @note Only call after EP_SendFrame() to do a no-interrupt transfer
 *
 * @param handle
 * @param enMasquerade Ture - Wait Port masquerading Tx ring, False - Wait direct enqueue Tx ring (fixed use
 *                      hardware ring 0)
 * @param ring The Port masquerading Tx ring index, active when enMasquerade is true
 */
static inline void SWT_WaitUnitilTxComplete(swt_handle_t *handle, bool enMasquerade, uint8_t ring)
{
    if (enMasquerade)
    {
        while (handle->epHandle->hw.si->BDR[ring + 1U].TBCIR != handle->epHandle->txBdRing[ring].producerIndex)
        {
        }
    }
    else
    {
        while (handle->epHandle->hw.si->BDR[0].TBCIR != handle->mgmtTxBdRing.producerIndex)
        {
        }
    }
}

/*!
 * @brief Reclaim tx descriptors.
 * This function is used to update the tx descriptor status.
 * For each reclaimed transmit frame the ep_reclaim_cb_t is called.
 *
 * This is called after being notified of a transmit completion from ISR.
 * It runs until there are no more frames to be reclaimed in the BD ring.
 *
 * @param handle
 * @param enMasquerade Ture - Reclaim Port masquerading Tx ring, False - Reclaim direct enqueue Tx ring (fixed use
 *                      hardware ring 0)
 * @param ring The Port masquerading Tx ring index, active when enMasquerade is true
 */
void SWT_ReclaimTxDescriptor(swt_handle_t *handle, bool enMasquerade, uint8_t ring);

/*!
 * @brief Receives management frames (host reason not zero) with zero copy
 *
 * @param handle
 * @param frame The frame descriptor pointer
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a management (host reason not zero) frame frame
 * @return kStatus_NETC_RxHRZeroFrame     Frame in Rx BD ring is regular frame, need call EP_ReceiveFrame()
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        No Rx BD ring is available
 * @return kStatus_NETC_LackOfResource    Appliction provided buffer is not enough
 */
status_t SWT_ReceiveFrame(swt_handle_t *handle, netc_frame_struct_t *frame, netc_frame_attr_t *attr);

/*!
 * @brief Receives management frame (host reason not zero) which will be copied in the provided buffer.
 *
 * @note The buffer size MUST be queried using SWT_GetRxFrameSize() beforehand.
 *
 * @param handle
 * @param buffer Buffer address
 * @param length Buffer length
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a management (host reason not zero) frame frame
 * @return kStatus_InvalidArgument        No Rx BD ring is available
 */
status_t SWT_ReceiveFrameCopy(swt_handle_t *handle, void *buffer, uint32_t length, netc_frame_attr_t *attr);

/*!
 * @brief Receives Switch Transmit Timestamp Reference Response.
 *
 * @note MUST call SWT_GetRxFrameSize() beforehand to confirm get the kStatus_NETC_RxTsrResp status.
 *
 * @param handle
 * @param tsr Timestamp Reference Response pointer
 * @return kStatus_Success                Successfully receive Switch Transmit Timestamp Reference Response
 * @return kStatus_InvalidArgument        No Rx BD ring is available
 */
status_t SWT_GetTimestampRefResp(swt_handle_t *handle, swt_tsr_resp_t *tsr);

/*!
 * brief Gets the size of the pending frame in the specified receive ring buffer.
 *
 * @note Frame size without FCS, and the size will be zero when Rx BD is Timestamp Reference Response message.
 *
 * @param handle The ENET handler structure. This is the same handler pointer used in the ENET_Init.
 * @param length The length of the valid frame received.
 * @return kStatus_Success                Successfully get the length of a management (host reason not zero) frame
 * @return kStatus_NETC_RxHRZeroFrame     Frame in Rx BD ring is regular frame, need call EP_GetRxFrameSize() to get
 *                                        frame size
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        No Rx BD ring is available
 */
status_t SWT_GetRxFrameSize(swt_handle_t *handle, uint32_t *length);

