JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_switch.h
/*! @} */ // end of netc_swt_xfer
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_xfer
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_stat
#endif
/*! @addtogroup netc_swt_stat
 * @{
 */

/*!
 * @brief Get Switch cut through forwarding count
 *
 * Get the Cut-through frames counter of frames forwarded to at least one egress port.
 *
 * @param handle
 * @param statistic pointer to the statistic count data
 * @return kStatus_Success
 */
static inline status_t SWT_GetCutThroughForwardStatistic(swt_handle_t *handle, uint32_t *statistic)
{
    *statistic = handle->hw.base->CTFCR;
    return kStatus_Success;
}

/*!
 * @brief Get statistic of the congestion group
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetETMCongestionGroupStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_etmcg_stse_t *statistic);

/*!
 * @brief Get the statistic for the class queue in specified switch port
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetETMClassQueueStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_etmcq_stse_t *statistic);

/*!
 * @brief Get egress count table entry number
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_GetECStatistic()/SWT_ResetECStatistic() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_GetECEntryNum(swt_handle_t *handle)
{
    return handle->hw.common->ECTCAPR & NETC_SW_ENETC_ECTCAPR_NUM_ENTRIES_MASK;
}

/*!
 * @brief Get statistic for specified egress count table entry
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetECStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_ec_stse_t *statistic);

/*!
 * @brief Reset statistic for specified egress count table entry
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_ResetECStatistic(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the port discard statistic and reason
 *
 * Get the discarded count of frames and its reasons.
 *
 * @param handle
 * @param portIdx port index
 * @param discardType Port discard type.
 * @param statistic pointer to the statistic data
 * @return kStatus_Success
 */
static inline status_t SWT_GetPortDiscardStatistic(swt_handle_t *handle,
                                                   netc_hw_port_idx_t portIdx,
                                                   netc_port_discard_tpye_t discardType,
                                                   netc_port_discard_statistic_t *statistic)
{
    NETC_PortGetDiscardStatistic(handle->hw.ports[portIdx].port, discardType, statistic);
    return kStatus_Success;
}

/*!
 * @brief Clean the Port Rx discard reason. Set the related bits to 1 to clear the specific reasons
 *
 * @param handle
 * @param portIdx port index
 * @param discardType Port discard type.
 * @param reason0
 * @param reason1
 * @return kStatus_Success
 */
static inline status_t SWT_ClearPortDiscardReason(swt_handle_t *handle,
                                                  netc_hw_port_idx_t portIdx,
                                                  netc_port_discard_tpye_t discardType,
                                                  uint32_t reason0,
                                                  uint32_t reason1)
{
    NETC_PortClearDiscardReason(handle->hw.ports[portIdx].port, discardType, reason0, reason1);
    return kStatus_Success;
}

/*!
 * @brief Clean the Port Rx discard reason. Set the related bits to 1 to clear the specific reasons
 *
 * @param handle
 * @param statistic
 * @return kStatus_Success
 */
static inline status_t SWT_GetFDBInUseEntriesNumber(swt_handle_t *handle, netc_switch_inuse_fdb_statistic_t *statistic)
{
    statistic->staticEntries     = (uint16_t)(handle->hw.base->FDBHTOR0 & NETC_SW_FDBHTOR0_STATIC_ENTRIES_MASK);
    statistic->camEntries        = (uint16_t)((handle->hw.base->FDBHTOR0 >> NETC_SW_FDBHTOR0_NUM_GENTRIES_SHIFT) &
                                       NETC_SW_FDBHTOR0_NUM_GENTRIES_MASK);
    statistic->dynamicEntries    = (uint16_t)(handle->hw.base->FDBHTOR1 & NETC_SW_FDBHTOR1_DYN_ENTRIES_MASK);
    statistic->dynamicEntriesHWM = (uint16_t)((handle->hw.base->FDBHTOR1 >> NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_SHIFT) &
                                              NETC_SW_FDBHTOR1_HWM_DYN_ENTRIES_MASK);
    return kStatus_Success;
}

/*!
 * @brief Get Switch port time gate scheduling gate list status
 *
 * @param handle
 * @param portIdx port index
 * @return Port status flags which are ORed by the enumerators in the @ref netc_port_tgsl_status_t
 */
static inline uint32_t SWT_GetPortTGSListStatus(swt_handle_t *handle, netc_hw_port_idx_t portIdx)
{
    return NETC_PortGetTGSListStatus(handle->hw.ports[portIdx].port);
}
/*! @} */ // end of netc_swt_stat
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_stat
#endif

#if defined(__cplusplus)
}
#endif
#endif /* _FSL_NETC_SWITCH_H_ */
